In [35]:
import pandas as pd
import numpy as np

## DataFrames Basic Operations

In [36]:
df1=pd.DataFrame({
    'A':[1,2,3,4,5],
    'B':[10,20,30,40,50],
    'c':[100,200,300,400,500]    
})

In [37]:
df1

   A   B    c
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [38]:
df1.shape

(5, 3)

In [39]:
df1.columns

Index(['A', 'B', 'c'], dtype='object')

In [40]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   c       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [41]:
df1.describe()

              A          B           c
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [42]:
df1['A']+10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

## Dataframes Applying Functions

In [43]:
def square(x):
    return x**2

In [44]:
df1['D']=df1['B'].apply(square)

In [45]:
df1

   A   B    c     D
0  1  10  100   100
1  2  20  200   400
2  3  30  300   900
3  4  40  400  1600
4  5  50  500  2500

In [46]:
df1['D']=df1['D'].apply(lambda x:x//2)

In [47]:
df1

   A   B    c     D
0  1  10  100    50
1  2  20  200   200
2  3  30  300   450
3  4  40  400   800
4  5  50  500  1250